---
kind: type
id: T:Autodesk.Revit.DB.ImageBackgroundSettings
source: html/543287b5-d534-2b3a-d285-036e54a0256d.htm
---
# Autodesk.Revit.DB.ImageBackgroundSettings

Represents the rendering image background settings.

## Syntax (C#)
```csharp
public class ImageBackgroundSettings : BackgroundSettings
```